{
   "prologue":"Legends whisper of the Golden Banana, an artifact of unparalleled deliciousness and immense power, hidden within the Temple of the Watchful Trees. You, a renowned (or perhaps just very hungry) adventurer, have braved treacherous jungles to seek this legendary fruit, said to grant eternal potassium.",
   "story_tree":[
      {
         "id":"start",
         "scene_description":"A grand, ancient temple entrance carved into a mountainside, overgrown with lush jungle vines. Giant, gnarled banana trees with unsettlingly human-like knots stand sentinel on either side. Sunlight filters through the dense canopy, casting eerie shadows.",
         "narration":"You stand before the fabled Temple of the Watchful Trees. The air is thick with humidity and the scent of overripe fruit. The ancient banana trees seem to lean in, their leafy canopies like watching eyes.",
         "choices":[
            {
               "text":"Enter the temple boldly.",
               "next_id":"main_hall"
            },
            {
               "text":"Try to sneak around the watchful trees.",
               "next_id":"sneaky_fail"
            }
         ],
         "is_ending":false
      },
      {
         "id":"main_hall",
         "scene_description":"Inside the temple, a vast hall with crumbling stone pillars. Golden banana motifs adorn the walls. In the center, a pedestal holds three ornate chests. Strange, faint whispers echo.",
         "narration":"The main hall is surprisingly intact, though dust motes dance in the shafts of light. Three chests beckon, each possibly containing the Golden Banana, or perhaps just a terrible curse.",
         "choices":[
            {
               "text":"Open the left chest.",
               "next_id":"left_chest_success"
            },
            {
               "text":"Open the middle chest.",
               "next_id":"middle_chest_trap"
            },
            {
               "text":"Open the right chest.",
               "next_id":"right_chest_trap"
            }
         ],
         "is_ending":false
      },
      {
         "id":"sneaky_fail",
         "scene_description":"Thorny vines erupt from the ground, ensnaring your legs. The banana trees rustle menacingly, their shadows lengthening and twisting.",
         "narration":"Your attempt to be stealthy was a mistake. The temple's guardians, the very trees themselves, have caught you. Their roots lash out, pulling you into the earth.",
         "choices":[
            
         ],
         "is_ending":true,
         "outcome":"failure"
      },
      {
         "id":"left_chest_success",
         "scene_description":"A radiant, golden banana rests inside the chest, glowing with an inner light. The air shimmers with ancient energy. A faint, triumphant chime sounds.",
         "narration":"Success! The legendary Golden Banana is yours. Its peel gleams with an almost blinding light, and you feel a surge of pure, unadulterated potassium power.",
         "choices":[
            
         ],
         "is_ending":true,
         "outcome":"success"
      },
      {
         "id":"middle_chest_trap",
         "scene_description":"As you open the middle chest, a cloud of spores erupts, causing uncontrollable laughter and making your vision blur into a psychedelic swirl of yellow.",
         "narration":"A burst of enchanted banana dust fills the air! You can't stop laughing, and the temple walls seem to melt and reform into dancing banana shapes. You've succumbed to the Banana King's jest.",
         "choices":[
            
         ],
         "is_ending":true,
         "outcome":"failure"
      },
      {
         "id":"right_chest_trap",
         "scene_description":"A swarm of angry, tiny monkeys, guarding the chest, leaps out. They chatter furiously and begin pelting you with rotten banana peels.",
         "narration":"Beware the monkey guardians! They defend the treasure with surprising ferocity, and their aim with rotten fruit is impeccable. You are quickly overwhelmed and forced to retreat.",
         "choices":[
            
         ],
         "is_ending":true,
         "outcome":"failure"
      }
   ]
}